original/httperf/test2.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=54.69.236.149 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.05 --send-buffer=4096 --recv-buffer=16384 --wsesslog=700,0.000,input.txt
Maximum connect burst length: 2

Total: connections 700 requests 8851 replies 8652 test-duration 35.162 s

Connection rate: 19.9 conn/s (50.2 ms/conn, <=677 concurrent connections)
Connection time [ms]: min 1535.5 avg 13020.3 max 34935.0 median 8569.5 stddev 10183.1
Connection time [ms]: connect 124.3
Connection length [replies/conn]: 332.769

Request rate: 251.7 req/s (4.0 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 83.6 avg 245.8 max 308.0 stddev 82.9 (7 samples)
Reply time [ms]: response 69.3 transfer 0.0
Reply size [B]: header 217.0 content 2132.0 footer 0.0 (total 2349.0)
Reply status: 1xx=0 2xx=8652 3xx=0 4xx=0 5xx=0

CPU time [s]: user 25.16 system 9.99 (user 71.6% system 28.4% total 100.0%)
Net I/O: 590.8 KB/s (4.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 8652 
Session rate [sess/s]: min 0.20 avg 0.74 max 1.00 stddev 0.28 (26/26)
Session: avg 1.00 connections/session
Session lifetime [s]: 13.0
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 1 0 1 5 4 0 1 0 2 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 1 0 2