original/httperf/test3.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=54.69.236.149 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.05 --send-buffer=4096 --recv-buffer=16384 --wsesslog=700,0.000,input.txt
Maximum connect burst length: 2

Total: connections 700 requests 9040 replies 8828 test-duration 35.567 s

Connection rate: 19.7 conn/s (50.8 ms/conn, <=676 concurrent connections)
Connection time [ms]: min 1524.4 avg 13611.5 max 33475.4 median 9923.5 stddev 10446.9
Connection time [ms]: connect 192.4
Connection length [replies/conn]: 326.963

Request rate: 254.2 req/s (3.9 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 83.6 avg 247.2 max 306.6 stddev 83.5 (7 samples)
Reply time [ms]: response 67.1 transfer 0.0
Reply size [B]: header 217.0 content 2131.0 footer 0.0 (total 2348.0)
Reply status: 1xx=0 2xx=8828 3xx=0 4xx=0 5xx=0

CPU time [s]: user 25.61 system 9.95 (user 72.0% system 28.0% total 100.0%)
Net I/O: 595.9 KB/s (4.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 8828 
Session rate [sess/s]: min 0.20 avg 0.76 max 1.00 stddev 0.30 (27/27)
Session: avg 1.00 connections/session
Session lifetime [s]: 13.6
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 1 0 1 5 4 0 1 0 2 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 2 0 2