original/httperf/test4.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=54.69.236.149 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.05 --send-buffer=4096 --recv-buffer=16384 --wsesslog=700,0.000,input.txt
Maximum connect burst length: 2

Total: connections 700 requests 9003 replies 8797 test-duration 35.565 s

Connection rate: 19.7 conn/s (50.8 ms/conn, <=676 concurrent connections)
Connection time [ms]: min 1530.1 avg 13616.9 max 33578.1 median 9912.5 stddev 10504.4
Connection time [ms]: connect 124.3
Connection length [replies/conn]: 325.815

Request rate: 253.1 req/s (4.0 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 83.6 avg 246.6 max 305.0 stddev 83.2 (7 samples)
Reply time [ms]: response 69.9 transfer 0.0
Reply size [B]: header 217.0 content 2132.0 footer 0.0 (total 2349.0)
Reply status: 1xx=0 2xx=8797 3xx=0 4xx=0 5xx=0

CPU time [s]: user 25.67 system 9.90 (user 72.2% system 27.8% total 100.0%)
Net I/O: 594.0 KB/s (4.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 8797 
Session rate [sess/s]: min 0.20 avg 0.76 max 1.00 stddev 0.30 (27/27)
Session: avg 1.00 connections/session
Session lifetime [s]: 13.6
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 1 0 1 5 4 0 1 0 2 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 2 0 2